degree = 20
print(degree)
print("-------------------------------------------------------------")
print(type(12))
print(type("12"))
print(type(True))
print(isinstance(12,int))
print(isinstance("12",int))
print("-------------------------------------------------------------")
s = """sss
sss"""
print(s)
print(type(str(True)))
print("-------------------------------------------------------------")
a = 1
b = 2
c = 3
print("拼接%s,拼接%s,拼接%s"%(a,b,c))
print(f"拼接{a},拼接{b},拼接{c}")
print("-------------------------------------------------------------")
d = input("请输入姓名：")
print(f"欢迎{d}")
print("-------------------------------------------------------------")
print(c/2)
print(c//2)
print(c*2)
print(c**2)
print("-------------------------------------------------------------")
print(2 > 1 and 3 > 2)
print(2 > 1 or 2 > 3)
print(not True)
